package by.epam.tr.main;

public class LinearTask7 {

	public static void main(String[] args) {
		//Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
		
		int a;
		int b;
		
		int area;
		
		a = 5;
		b = a * 2;
		
		area = a * b;
		
		System.out.println("a = " + a + " cm " + "\t b = " + b + " cm ");
		System.out.println(" ");
		System.out.println("area = " + area + " cm2 ");

	}

}
